'''
Задача 4
После трудного задания Роберт решил отдохнуть и поиграть в корейскую головоломку Ольбарбуруненсунсер. В журнале записана последовательность из знаков (, ) и ?, нужно заменить все знаки вопроса, чтобы полученная последовательность оказалась правильной. Роберт заметил, что не всякая последовательность имеет единственное решение и задумался, а сколько же решений при данных начальных условиях возможно?

Входные данные
Первая и единственная строка содержит последовательность из символов (, ) и ? длинной до 100100.
Результат работы
Выведите единственное число возможных решений головоломки.

Примеры
Входные данные
???
Результат работы
0
'''